./test_case4.o:	file format elf64-x86-64

.debug_info contents:
0x00000000: Compile Unit: length = 0x0000075f, format = DWARF32, version = 0x0005, unit_type = DW_UT_compile, abbr_offset = 0x0000, addr_size = 0x08 (next unit at 0x00000763)

0x0000000c: DW_TAG_compile_unit
              DW_AT_producer	("clang version 19.1.5 (https://github.com/llvm/llvm-project.git ab4b5a2db582958af1ee308a790cfdb42bd24720)")
              DW_AT_language	(DW_LANG_C_plus_plus_14)
              DW_AT_name	("test_case4.cpp")
              DW_AT_str_offsets_base	(0x00000008)
              DW_AT_stmt_list	(0x00000000)
              DW_AT_comp_dir	("/home/hzw/Downloads/test_cases/test_case3")
              DW_AT_low_pc	(0x0000000000000000)
              DW_AT_ranges	(indexed (0x8) rangelist = 0x000000a0
                 [0x0000000000001160, 0x000000000000128e)
                 [0x0000000000001290, 0x0000000000001597)
                 [0x00000000000015a0, 0x00000000000015b6)
                 [0x00000000000015c0, 0x00000000000016db)
                 [0x00000000000016e0, 0x00000000000017b6)
                 [0x00000000000017c0, 0x0000000000001940)
                 [0x0000000000001940, 0x000000000000199f)
                 [0x00000000000019a0, 0x00000000000019d0)
                 [0x00000000000019d0, 0x00000000000019fc)
                 [0x0000000000001a00, 0x0000000000001a0a)
                 [0x0000000000001a10, 0x0000000000001a2b)
                 [0x0000000000001a30, 0x0000000000001c21)
                 [0x0000000000001c30, 0x0000000000001d15)
                 [0x0000000000001d20, 0x0000000000001e99)
                 [0x0000000000001ea0, 0x0000000000001ed2))
              DW_AT_addr_base	(0x00000008)
              DW_AT_rnglists_base	(0x0000000c)

0x0000002b:   DW_TAG_base_type
                DW_AT_name	("char")
                DW_AT_encoding	(DW_ATE_signed_char)
                DW_AT_byte_size	(0x01)

0x0000002f:   DW_TAG_class_type
                DW_AT_calling_convention	(DW_CC_pass_by_reference)
                DW_AT_name	("Container_1")
                DW_AT_byte_size	(0x20)
                DW_AT_decl_file	("/home/hzw/Downloads/test_cases/test_case3/./test_case4.cpp")
                DW_AT_decl_line	(1)

0x00000035:     DW_TAG_member
                  DW_AT_name	("member_4")
                  DW_AT_type	(0x00000060 "long double")
                  DW_AT_decl_file	("/home/hzw/Downloads/test_cases/test_case3/./test_case4.cpp")
                  DW_AT_decl_line	(3)
                  DW_AT_data_member_location	(0x00)
                  DW_AT_accessibility	(DW_ACCESS_public)

0x0000003f:     DW_TAG_member
                  DW_AT_name	("member_5")
                  DW_AT_type	(0x0000002b "char")
                  DW_AT_decl_file	("/home/hzw/Downloads/test_cases/test_case3/./test_case4.cpp")
                  DW_AT_decl_line	(4)
                  DW_AT_data_member_location	(0x10)
                  DW_AT_accessibility	(DW_ACCESS_public)

0x00000049:     DW_TAG_subprogram
                  DW_AT_name	("Container_1")
                  DW_AT_decl_file	("/home/hzw/Downloads/test_cases/test_case3/./test_case4.cpp")
                  DW_AT_decl_line	(6)
                  DW_AT_declaration	(true)
                  DW_AT_external	(true)
                  DW_AT_accessibility	(DW_ACCESS_public)

0x0000004e:       DW_TAG_formal_parameter
                    DW_AT_type	(0x00000064 "Container_1 *")
                    DW_AT_artificial	(true)

0x00000053:       NULL

0x00000054:     DW_TAG_subprogram
                  DW_AT_name	("~Container_1")
                  DW_AT_decl_file	("/home/hzw/Downloads/test_cases/test_case3/./test_case4.cpp")
                  DW_AT_decl_line	(7)
                  DW_AT_declaration	(true)
                  DW_AT_external	(true)
                  DW_AT_accessibility	(DW_ACCESS_public)

0x00000059:       DW_TAG_formal_parameter
                    DW_AT_type	(0x00000064 "Container_1 *")
                    DW_AT_artificial	(true)

0x0000005e:       NULL

0x0000005f:     NULL

0x00000060:   DW_TAG_base_type
                DW_AT_name	("long double")
                DW_AT_encoding	(DW_ATE_float)
                DW_AT_byte_size	(0x10)

0x00000064:   DW_TAG_pointer_type
                DW_AT_type	(0x0000002f "Container_1")

0x00000069:   DW_TAG_class_type
                DW_AT_calling_convention	(DW_CC_pass_by_reference)
                DW_AT_name	("Container_0")
                DW_AT_byte_size	(0x50)
                DW_AT_decl_file	("/home/hzw/Downloads/test_cases/test_case3/./test_case4.cpp")
                DW_AT_decl_line	(10)

0x0000006f:     DW_TAG_inheritance
                  DW_AT_type	(0x0000002f "Container_1")
                  DW_AT_data_member_location	(0x00)
                  DW_AT_accessibility	(DW_ACCESS_public)

0x00000076:     DW_TAG_member
                  DW_AT_name	("member_1")
                  DW_AT_type	(0x0000002b "char")
                  DW_AT_decl_file	("/home/hzw/Downloads/test_cases/test_case3/./test_case4.cpp")
                  DW_AT_decl_line	(12)
                  DW_AT_data_member_location	(0x11)
                  DW_AT_accessibility	(DW_ACCESS_public)

0x00000080:     DW_TAG_member
                  DW_AT_name	("member_2")
                  DW_AT_type	(0x000000b5 "double")
                  DW_AT_decl_file	("/home/hzw/Downloads/test_cases/test_case3/./test_case4.cpp")
                  DW_AT_decl_line	(13)
                  DW_AT_data_member_location	(0x18)
                  DW_AT_accessibility	(DW_ACCESS_public)

0x0000008a:     DW_TAG_member
                  DW_AT_name	("member_3")
                  DW_AT_type	(0x000000b9 "int")
                  DW_AT_decl_file	("/home/hzw/Downloads/test_cases/test_case3/./test_case4.cpp")
                  DW_AT_decl_line	(14)
                  DW_AT_data_member_location	(0x20)
                  DW_AT_accessibility	(DW_ACCESS_public)

0x00000094:     DW_TAG_member
                  DW_AT_name	("member_10")
                  DW_AT_type	(0x0000002f "Container_1")
                  DW_AT_decl_file	("/home/hzw/Downloads/test_cases/test_case3/./test_case4.cpp")
                  DW_AT_decl_line	(15)
                  DW_AT_data_member_location	(0x30)
                  DW_AT_accessibility	(DW_ACCESS_public)

0x0000009e:     DW_TAG_subprogram
                  DW_AT_name	("Container_0")
                  DW_AT_decl_file	("/home/hzw/Downloads/test_cases/test_case3/./test_case4.cpp")
                  DW_AT_decl_line	(17)
                  DW_AT_declaration	(true)
                  DW_AT_external	(true)
                  DW_AT_accessibility	(DW_ACCESS_public)

0x000000a3:       DW_TAG_formal_parameter
                    DW_AT_type	(0x000000bd "Container_0 *")
                    DW_AT_artificial	(true)

0x000000a8:       NULL

0x000000a9:     DW_TAG_subprogram
                  DW_AT_name	("~Container_0")
                  DW_AT_decl_file	("/home/hzw/Downloads/test_cases/test_case3/./test_case4.cpp")
                  DW_AT_decl_line	(18)
                  DW_AT_declaration	(true)
                  DW_AT_external	(true)
                  DW_AT_accessibility	(DW_ACCESS_public)

0x000000ae:       DW_TAG_formal_parameter
                    DW_AT_type	(0x000000bd "Container_0 *")
                    DW_AT_artificial	(true)

0x000000b3:       NULL

0x000000b4:     NULL

0x000000b5:   DW_TAG_base_type
                DW_AT_name	("double")
                DW_AT_encoding	(DW_ATE_float)
                DW_AT_byte_size	(0x08)

0x000000b9:   DW_TAG_base_type
                DW_AT_name	("int")
                DW_AT_encoding	(DW_ATE_signed)
                DW_AT_byte_size	(0x04)

0x000000bd:   DW_TAG_pointer_type
                DW_AT_type	(0x00000069 "Container_0")

0x000000c2:   DW_TAG_class_type
                DW_AT_calling_convention	(DW_CC_pass_by_reference)
                DW_AT_name	("Container_2")
                DW_AT_byte_size	(0x30)
                DW_AT_decl_file	("/home/hzw/Downloads/test_cases/test_case3/./test_case4.cpp")
                DW_AT_decl_line	(21)

0x000000c8:     DW_TAG_inheritance
                  DW_AT_type	(0x0000002f "Container_1")
                  DW_AT_data_member_location	(0x00)
                  DW_AT_accessibility	(DW_ACCESS_public)

0x000000cf:     DW_TAG_member
                  DW_AT_name	("member_6")
                  DW_AT_type	(0x000000b5 "double")
                  DW_AT_decl_file	("/home/hzw/Downloads/test_cases/test_case3/./test_case4.cpp")
                  DW_AT_decl_line	(23)
                  DW_AT_data_member_location	(0x18)
                  DW_AT_accessibility	(DW_ACCESS_public)

0x000000d9:     DW_TAG_member
                  DW_AT_name	("member_7")
                  DW_AT_type	(0x00000060 "long double")
                  DW_AT_decl_file	("/home/hzw/Downloads/test_cases/test_case3/./test_case4.cpp")
                  DW_AT_decl_line	(24)
                  DW_AT_data_member_location	(0x20)
                  DW_AT_accessibility	(DW_ACCESS_public)

0x000000e3:     DW_TAG_subprogram
                  DW_AT_name	("Container_2")
                  DW_AT_decl_file	("/home/hzw/Downloads/test_cases/test_case3/./test_case4.cpp")
                  DW_AT_decl_line	(26)
                  DW_AT_declaration	(true)
                  DW_AT_external	(true)
                  DW_AT_accessibility	(DW_ACCESS_public)

0x000000e8:       DW_TAG_formal_parameter
                    DW_AT_type	(0x000000fa "Container_2 *")
                    DW_AT_artificial	(true)

0x000000ed:       NULL

0x000000ee:     DW_TAG_subprogram
                  DW_AT_name	("~Container_2")
                  DW_AT_decl_file	("/home/hzw/Downloads/test_cases/test_case3/./test_case4.cpp")
                  DW_AT_decl_line	(27)
                  DW_AT_declaration	(true)
                  DW_AT_external	(true)
                  DW_AT_accessibility	(DW_ACCESS_public)

0x000000f3:       DW_TAG_formal_parameter
                    DW_AT_type	(0x000000fa "Container_2 *")
                    DW_AT_artificial	(true)

0x000000f8:       NULL

0x000000f9:     NULL

0x000000fa:   DW_TAG_pointer_type
                DW_AT_type	(0x000000c2 "Container_2")

0x000000ff:   DW_TAG_class_type
                DW_AT_calling_convention	(DW_CC_pass_by_reference)
                DW_AT_name	("Container_3")
                DW_AT_byte_size	(0x60)
                DW_AT_decl_file	("/home/hzw/Downloads/test_cases/test_case3/./test_case4.cpp")
                DW_AT_decl_line	(30)

0x00000105:     DW_TAG_inheritance
                  DW_AT_type	(0x00000069 "Container_0")
                  DW_AT_data_member_location	(0x00)

0x0000010b:     DW_TAG_member
                  DW_AT_name	("member_8")
                  DW_AT_type	(0x000000b9 "int")
                  DW_AT_decl_file	("/home/hzw/Downloads/test_cases/test_case3/./test_case4.cpp")
                  DW_AT_decl_line	(32)
                  DW_AT_data_member_location	(0x50)
                  DW_AT_accessibility	(DW_ACCESS_public)

0x00000115:     DW_TAG_member
                  DW_AT_name	("member_9")
                  DW_AT_type	(0x00000136 "float")
                  DW_AT_decl_file	("/home/hzw/Downloads/test_cases/test_case3/./test_case4.cpp")
                  DW_AT_decl_line	(33)
                  DW_AT_data_member_location	(0x54)
                  DW_AT_accessibility	(DW_ACCESS_public)

0x0000011f:     DW_TAG_subprogram
                  DW_AT_name	("Container_3")
                  DW_AT_decl_file	("/home/hzw/Downloads/test_cases/test_case3/./test_case4.cpp")
                  DW_AT_decl_line	(35)
                  DW_AT_declaration	(true)
                  DW_AT_external	(true)
                  DW_AT_accessibility	(DW_ACCESS_public)

0x00000124:       DW_TAG_formal_parameter
                    DW_AT_type	(0x0000013a "Container_3 *")
                    DW_AT_artificial	(true)

0x00000129:       NULL

0x0000012a:     DW_TAG_subprogram
                  DW_AT_name	("~Container_3")
                  DW_AT_decl_file	("/home/hzw/Downloads/test_cases/test_case3/./test_case4.cpp")
                  DW_AT_decl_line	(36)
                  DW_AT_declaration	(true)
                  DW_AT_external	(true)
                  DW_AT_accessibility	(DW_ACCESS_public)

0x0000012f:       DW_TAG_formal_parameter
                    DW_AT_type	(0x0000013a "Container_3 *")
                    DW_AT_artificial	(true)

0x00000134:       NULL

0x00000135:     NULL

0x00000136:   DW_TAG_base_type
                DW_AT_name	("float")
                DW_AT_encoding	(DW_ATE_float)
                DW_AT_byte_size	(0x04)

0x0000013a:   DW_TAG_pointer_type
                DW_AT_type	(0x000000ff "Container_3")

0x0000013f:   DW_TAG_subprogram
                DW_AT_low_pc	(0x0000000000001160)
                DW_AT_high_pc	(0x000000000000128e)
                DW_AT_frame_base	(DW_OP_reg6 RBP)
                DW_AT_linkage_name	("_Z6func11xxf")
                DW_AT_name	("func11")
                DW_AT_decl_file	("/home/hzw/Downloads/test_cases/test_case3/./test_case4.cpp")
                DW_AT_decl_line	(149)
                DW_AT_type	(0x00000738 "long long")
                DW_AT_external	(true)

0x0000014f:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_fbreg -8)
                  DW_AT_name	("p_0")
                  DW_AT_decl_file	("/home/hzw/Downloads/test_cases/test_case3/./test_case4.cpp")
                  DW_AT_decl_line	(149)
                  DW_AT_type	(0x00000738 "long long")

0x0000015a:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_fbreg -16)
                  DW_AT_name	("p_1")
                  DW_AT_decl_file	("/home/hzw/Downloads/test_cases/test_case3/./test_case4.cpp")
                  DW_AT_decl_line	(149)
                  DW_AT_type	(0x00000738 "long long")

0x00000165:     DW_TAG_formal_parameter
                  DW_AT_location	(DW_OP_fbreg -20)
                  DW_AT_name	("p_2")
                  DW_AT_decl_file	("/home/hzw/Downloads/test_cases/test_case3/./test_case4.cpp")
                  DW_AT_decl_line	(149)
                  DW_AT_type	(0x00000136 "float")

0x00000170:     DW_TAG_variable
                  DW_AT_location	(DW_OP_fbreg -32)
                  DW_AT_name	("var243")
                  DW_AT_decl_file	("/home/hzw/Downloads/test_cases/test_case3/./test_case4.cpp")
                  DW_AT_decl_line	(151)
                  DW_AT_type	(0x00000738 "long long")

0x0000017b:     DW_TAG_variable
                  DW_AT_location	(DW_OP_fbreg -40)
                  DW_AT_name	("var244")
                  DW_AT_decl_file	("/home/hzw/Downloads/test_cases/test_case3/./test_case4.cpp")
                  DW_AT_decl_line	(153)
                  DW_AT_type	(0x00000740 "Container_1 *")

0x00000186:     DW_TAG_variable
                  DW_AT_location	(DW_OP_fbreg -56)
                  DW_AT_name	("var245")
                  DW_AT_decl_file	("/home/hzw/Downloads/test_cases/test_case3/./test_case4.cpp")
                  DW_AT_decl_line	(155)
                  DW_AT_type	(0x00000136 "float")

0x00000191:     DW_TAG_lexical_block
                  DW_AT_low_pc	(0x00000000000011f5)
                  DW_AT_high_pc	(0x000000000000125c)

0x00000197:       DW_TAG_variable
